package Homeworks.L2HW_Java_Prepelita_Natalia;
//Упражнение 4 стр.125
//Напишите цикл for, в котором перебирались бы значения от 1000 до 0 с шагом -2.
public class ForTest1 {
    public static void main(String[] args) {
        for (int i=1000; i >=0; i-=2){
            System.out.println(i);
        }
    }
}
